Дипломная_работа/src/Catalogs/ВКМ_ДоговорыКонтрагентов/ВКМ_ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ДоговорыКонтрагентов</name>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВКМ_ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВКМ_Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дипломная_работа/src/Enums/ВКМ_ВидыДоговоров/ВКМ_ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_ВидыДоговоров</name>
  <enumValues>
    <name>Абонентский</name>
  </enumValues>
  <enumValues>
    <name>Разовый</name>
  </enumValues>
</mdclass:Enum>

Дипломная_работа/src/Catalogs/ВКМ_ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ВКМ_УправлениеВидимостью()
	
	// 1. Проверяем, является ли договор Абонентским
	ЭтоАбонентский = (Объект.ВидДоговора = Перечисления.ВКМ_ВидыДоговоров.Абонентский);
	
	// 2. Логика для Абонентского договора:
	// Показываем Абонентскую плату, СКРЫВАЕМ Стоимость часа
	Элементы.АбонентскаяПлата.Видимость = ЭтоАбонентский;
	
	// 3. Логика для Разового договора:
	// Скрываем Абонентскую плату, ПОКАЗЫВАЕМ Стоимость часа
	// Для этого используем частицу "НЕ" (инверсия)
	Элементы.СтоимостьЧаса.Видимость = НЕ ЭтоАбонентский;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Это нужно, чтобы при открытии уже созданного договора поле тоже скрывалось
	ВКМ_УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// Это срабатывает, когда ты кликаешь мышкой в форме
	ВКМ_УправлениеВидимостью();
КонецПроцедуры
